PANDAS 01

#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size =(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  5  4  6  2  4
1  4  2  9  1  2
2  4  1  9  6  1
3  7  5  4  7  9
4  1  1  6  3  3

In [4]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

Menyertakan Prefix Kolom

In [7]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        5        4        6        2        4
1        4        2        9        1        2
2        4        1        9        6        1
3        7        5        4        7        9
4        1        1        6        3        3

Menyertakan Suffix Kolom

In [8]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        5        4        6        2        4
1        4        2        9        1        2
2        4        1        9        6        1
3        7        5        4        7        9
4        1        1        6        3        3

PANDAS 02

#02: Pemilihan baris (rows selection) pada data frame

In [9]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size = (n_rows, n_cols)), columns = cols)
df

   A  B  C  D  E
0  1  4  3  2  4
1  1  2  1  3  4
2  1  2  4  1  4
3  1  3  4  1  1
4  3  4  4  3  1
5  3  4  1  3  4
6  3  3  3  3  3
7  4  1  3  1  3
8  1  3  1  3  4
9  4  3  4  3  1

Untuk membuat kolom A hanya terdiri dari angka 1 atau 3

In [10]:
df[(df['A'] == 1)|(df['A'] == 3)]

   A  B  C  D  E
0  1  4  3  2  4
1  1  2  1  3  4
2  1  2  4  1  4
3  1  3  4  1  1
4  3  4  4  3  1
5  3  4  1  3  4
6  3  3  3  3  3
8  1  3  1  3  4

Selection dengan fungsi isin(), sama seperti yang atas cuman berbeda fungsi

In [11]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  1  4  3  2  4
1  1  2  1  3  4
2  1  2  4  1  4
3  1  3  4  1  1
4  3  4  4  3  1
5  3  4  1  3  4
6  3  3  3  3  3
8  1  3  1  3  4

Bagaima untuk menampilkan baris yang tidak sama dengan 1 atau tidak sama dengan 3?

Operator negasi ~

In [13]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
7  4  1  3  1  3
9  4  3  4  3  1

PANDAS 03

#03 Konversi tipe data String ke Numerik pada kolom data frame

In [14]:
data = {'col1': ['1', '2', '3', 'teks'],
        'col2': ['1', '2', '3', '4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [15]:
df.dtypes

col1    object
col2    object
dtype: object

Konversi tipe data dengan fungsi astype()

In [22]:
df_x = df.astype({'col2': 'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [21]:
df_x.dtypes

col1    object
col2     int64
dtype: object

Konversi tipe data numnerik dengan fungsi to_numeric(), coerce utk data yang tidak dapat diubah menjadi numerik

In [23]:
df.apply(pd.to_numeric, errors = 'coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

PANDAS 04

#4 Pemilihan kolom (columns selection) pada data frame berdasarkan tipe data

In [26]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)), columns = cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

dt = pd.date_range('2023-05-10', periods=(n_rows), freq='H')
df.index = pd.to_datetime(dt, format='%d%b%Y:%H:%M:%S.%f')

df['teks'] = list('ABCDE')
df

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_17976\1698719069.py:8: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  dt = pd.date_range('2023-05-10', periods=(n_rows), freq='H')

                     bil_pecahan  bil_bulat teks
2023-05-10 00:00:00         19.0         18    A
2023-05-10 01:00:00          2.0          4    B
2023-05-10 02:00:00          4.0          8    C
2023-05-10 03:00:00         18.0         12    D
2023-05-10 04:00:00          8.0          6    E

In [28]:
df.dtypes

bil_pecahan    float64
bil_bulat        int32
teks            object
dtype: object

Cara untuk memilih kolom bertipe data numerik saja

In [29]:
df.select_dtypes(include = 'number')

                     bil_pecahan  bil_bulat
2023-05-10 00:00:00         19.0         18
2023-05-10 01:00:00          2.0          4
2023-05-10 02:00:00          4.0          8
2023-05-10 03:00:00         18.0         12
2023-05-10 04:00:00          8.0          6

In [30]:
df.select_dtypes(include = 'float')

                     bil_pecahan
2023-05-10 00:00:00         19.0
2023-05-10 01:00:00          2.0
2023-05-10 02:00:00          4.0
2023-05-10 03:00:00         18.0
2023-05-10 04:00:00          8.0

In [31]:
df.select_dtypes(include = 'int')

                     bil_bulat
2023-05-10 00:00:00         18
2023-05-10 01:00:00          4
2023-05-10 02:00:00          8
2023-05-10 03:00:00         12
2023-05-10 04:00:00          6

Cara untuk memilih kolom bertipe data String atau object

In [32]:
df.select_dtypes(include='object')

                    teks
2023-05-10 00:00:00    A
2023-05-10 01:00:00    B
2023-05-10 02:00:00    C
2023-05-10 03:00:00    D
2023-05-10 04:00:00    E

Cara untuk memilih kolom bertipe data datetime

In [33]:
df.select_dtypes(include='datetime')

Empty DataFrame
Columns: []
Index: [2023-05-10 00:00:00, 2023-05-10 01:00:00, 2023-05-10 02:00:00, 2023-05-10 03:00:00, 2023-05-10 04:00:00]

Cara untuk menampilkan kolom dengan kombinasi tipe data

In [35]:
df.select_dtypes(include= ['datetime', 'object'])

                    teks
2023-05-10 00:00:00    A
2023-05-10 01:00:00    B
2023-05-10 02:00:00    C
2023-05-10 03:00:00    D
2023-05-10 04:00:00    E